EnKF-Training-codes/inputs/foam_base/case1/0/Res
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "2000";
    object      Res;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
31383
(
0.00732845
0.0319815
0.0712182
0.0308033
0.283319
0.197885
0.0299091
0.273374
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
317
(
1.21856e-19
1.27778e-19
1.23073e-19
1.19504e-19
1.16848e-19
1.1466e-19
1.12772e-19
1.11167e-19
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform 1;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
1
1
1
1
1
1
1
1
...
)
;
    }
    top
    {
        type            calculated;
        value           uniform 1;
    }
}


// ************************************************************************* //
