EnKF-Training-codes/inputs/foam_base/case1/0/TuM
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "2000";
    object      TuM;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
31383
(
0.00378802
0.00399746
0.00152623
0.00385382
0.00227385
0.00120945
0.00374323
0.00218138
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
317
(
0.00378656
0.00399633
0.00385277
0.00374223
0.00365929
0.00359127
0.00353305
0.00348327
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform 0.0315811;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
0.00529796
0.00467013
0.0100047
0.0185426
0.0291942
0.0422378
0.0517086
0.0622795
...
)
;
    }
    top
    {
        type            calculated;
        value           uniform 0.0315811;
    }
}


// ************************************************************************* //
