EnKF-Training-codes/inputs/foam_base/case1/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "2000";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   nonuniform List<scalar> 
31383
(
0.791871
0.888861
0.128259
0.825676
0.287224
0.0798838
0.779219
0.26413
...
)
;

boundaryField
{
    base
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
317
(
0.791871
0.888861
0.825676
0.779219
0.745573
0.718701
0.696185
0.677203
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 20;
    }
    outlet
    {
        type            zeroGradient;
    }
    top
    {
        type            fixedValue;
        value           uniform 20;
    }
}


// ************************************************************************* //
