EnKF-Training-codes/inputs/foam_base/case1/0/q2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "2000";
    object      q2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
31383
(
1
1
1
1
1
1
1
1
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           uniform 1;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
0.0199787
0.028594
0.00279538
0.000788208
0.000211959
8.11775e-05
3.61874e-05
1.7461e-05
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
8.87106e-12
1.20661e-11
1.28206e-11
1.43572e-11
2.16226e-11
3.15906e-11
9.53762e-11
2.39313e-10
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
317
(
1.79979e-16
1.78969e-16
1.77543e-16
1.76264e-16
1.74805e-16
1.73404e-16
1.72013e-16
1.70729e-16
...
)
;
    }
}


// ************************************************************************* //
