EnKF-Training-codes/inputs/foam_base/case1/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|    HiSA: High Speed Aerodynamic solver                                      |
|    Copyright (C) 2014-2017 Johan Heyns - CSIR, South Africa                 |
|    Copyright (C) 2014-2017 Oliver Oxtoby - CSIR, South Africa               |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluxScheme           AUSMPlusUp;
lowMachAusm          false;

ddtSchemes
{
    default bounded dualTime rPseudoDeltaT steadyState;
}
    /*default          Gauss linear;
    grad(nuTilda)    cellLimited Gauss linear 1;
    grad(k)          cellLimited Gauss linear 0.5;
    grad(omega)      cellLimited Gauss linear 0.5;
    grad(T)          cellLimited Gauss linear 0.5;*/
gradSchemes
{
    /*default          Gauss linear;
    grad(nuTilda)    cellLimited Gauss linear 0.1;
    grad(k)          cellLimited Gauss linear 0.1;
    grad(omega)      cellLimited Gauss linear 0.1;
    grad(T)          cellLimited Gauss linear 0.1;*/
    default          faceLeastSquares linear;
    grad(nuTilda)    cellLimited Gauss linear 0.9;
    grad(U)          cellLimited Gauss linear 0.9;
    grad(k)          cellLimited Gauss linear 0.9;
    grad(omega)      cellLimited Gauss linear 0.9;
}
divSchemes
{
    default          Gauss linear;
    div(tauMC)       Gauss linear;
    div(phi,nuTilda) bounded Gauss upwind phi;//Gauss linear;//bounded Gauss upwind phi;
    div(phi,k)       bounded Gauss upwind phi;
    div(phi,omega)   bounded Gauss upwind phi;
    
}
laplacianSchemes
{
    default Gauss linear corrected;
    laplacian(muEff,U) Gauss linear compact;
    laplacian(alphaEff,e) Gauss linear compact;
}

interpolate          wVanLeer;
interpolationSchemes
{
    default          linear;
    reconstruct(rho) $interpolate;
    reconstruct(U)   $interpolate;
    reconstruct(T)   wVanLeer;
}
snGradSchemes
{
    default corrected;
}
wallDist
{
    method meshWave;//
}
/*
ddtSchemes
{
    default          bounded dualTime rPseudoDeltaT steadyState;
}

gradSchemes
{
    default         Gauss linear;
    grad(nuTilda)    cellLimited Gauss linear 0.5;
    grad(T)          cellLimited Gauss linear 0.5;
    grad(k)          cellLimited Gauss linear 0.5;
    grad(omega)      cellLimited Gauss linear 0.5;
}

divSchemes
{
    default          Gauss linear;
    div(tauMC)       Gauss linear;
    div(phi,nuTilda) bounded Gauss upwind phi;//Gauss linear;//bounded Gauss upwind phi;
    div(phi,k)       bounded Gauss upwind phi;
    div(phi,omega)   bounded Gauss upwind phi;
}

laplacianSchemes
{
    default                     Gauss linear corrected;
    laplacian(muEff,U)          Gauss linear corrected;//Gauss linear compact;
    laplacian(alphaEff,e)       Gauss linear corrected;//Gauss linear compact;
    laplacian(yPsi)             Gauss linear corrected;
}

//interpolate          wVanLeer;//Minmod wMUSCL wSuperBee wVanLeer
interpolationSchemes
{
    default         linear;
    reconstruct(rho) wVanLeer;
    reconstruct(U)  wVanLeer;
    reconstruct(T)  wVanLeer;
    
    //default         linear;
    //reconstruct(rho) vanLeer;
    //reconstruct(U)  vanLeerV;
    //reconstruct(T)  vanLeer;
}




snGradSchemes
{
    default          corrected;
}

wallDist
{
    method meshWave;
}
*/

// ************************************************************************* //
