EnKF-Training-codes/inputs/foam_base/case1/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
type sets;
libs ("libsampling.so");

setFormat raw;
surfaceFormat vtk;
interpolationScheme cellPoint;

fields
(
    U
);

sets
(
    line_x0
    {
        type        midPoint;
        axis        y;
        start       (-0.1 0 0.27);
        end         (-0.1 0.1 0.27);
    }
);


// *********************************************************************** //
